In [153]:
people = {
    "first": ["Corey", "Jane", "John"],
    "last": ["Schafer", "Doe", "Doe"],
    "email": ["CoreyMSchafer@gmail.com", "JaneDoe@email.com", "JohnDoe@email.com"]

}

import pandas as pd

In [154]:
df = pd.DataFrame(people)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

##### columns

In [155]:
df['full_name'] = df['first'] + ' ' + df['last']
# add two columns together
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [156]:
df.drop(columns=['first', 'last'], inplace=True)
# delete 'first' and 'last' columns

In [157]:
df['full_name'].str.split(' ')
# to split columns

0    [Corey, Schafer]
1         [Jane, Doe]
2         [John, Doe]
Name: full_name, dtype: object

In [158]:
df['full_name'].str.split(' ', expand=True)
# to split columns by columns names

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [159]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)
# assign to the columns names
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [160]:
df.drop(columns='full_name', inplace=True)

##### rows

In [161]:
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John      Doe

In [162]:
people2 = {
    "first": ["Tony", "Steve"],
    "last": ["Spark", "Adobe"],
    "email": ["spark@gmail.com", "adobe@email.com"]

}

df2 = pd.DataFrame(people2)
df2

   first   last            email
0   Tony  Spark  spark@gmail.com
1  Steve  Adobe  adobe@email.com

In [165]:
# concatenating two dataframe
df = pd.concat([df, df2], ignore_index=True)
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John      Doe
3          spark@gmail.com   Tony    Spark
4          adobe@email.com  Steve    Adobe
5          spark@gmail.com   Tony    Spark
6          adobe@email.com  Steve    Adobe

In [169]:
# add new row
new_row = pd.Series({'first': 'ABC', 'last': 'DFE'})
pd.concat([df, new_row.to_frame().T], ignore_index=True)

# adding new row

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John      Doe
3          spark@gmail.com   Tony    Spark
4          adobe@email.com  Steve    Adobe
5          spark@gmail.com   Tony    Spark
6          adobe@email.com  Steve    Adobe
7                      NaN    ABC      DFE

In [170]:
df.drop(index=3) #  delete index

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John      Doe
4          adobe@email.com  Steve    Adobe
5          spark@gmail.com   Tony    Spark
6          adobe@email.com  Steve    Adobe

In [171]:
# delete row with filter
filt = df['last'] == 'Doe'
df.drop(index=df[filt].index)

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
3          spark@gmail.com   Tony    Spark
4          adobe@email.com  Steve    Adobe
5          spark@gmail.com   Tony    Spark
6          adobe@email.com  Steve    Adobe